<?php
return [
  //是否开启调试模式
  'app_debug'              => false,
  // 是否开启路由
  'url_route_on'           => true,
  // 是否强制使用路由
  'url_route_must'         => false,
  // 默认输出类型
  'default_return_type'    => 'html',


  //校运会赛事项目配置
  'match' => [
    'class' => [
      '1' => '大学生组个人赛',
      '2' => '大学生团体赛'
    ],
    'item_1' => [
      '1101' => '男子 110米栏',
      '1102' => '男子 100米',
      '1103' => '男子 200米',
      '1104' => '男子 400米',
      '1105' => '男子 800米',
      '1106' => '男子 1500米',
      '1107' => '男子 5000米',
      '1108' => '男子 跳高',
      '1109' => '男子 跳远',
      '1110' => '男子 三级跳远',
      '1111' => '男子 铅球',
      '1112' => '男子 标枪',
      '1113' => '男子 滚铁环',
      '1201' => '女子 100米',
      '1202' => '女子 200米',
      '1203' => '女子 400米',
      '1204' => '女子 800米',
      '1205' => '女子 1500米',
      '1206' => '女子 3000米',
      '1207' => '女子 跳高',
      '1208' => '女子 跳远',
      '1209' => '女子 三级跳远',
      '1210' => '女子 铅球',
      '1211' => '女子 标枪',
      '1213' => '女子 滚铁环'
    ],
    'item_2' => [
      '2101' => '男子 4×100米接力',
      '2102' => '男子 4×400米接力',
      '2103' => '男子 三人踏板竞速',
      '2104' => '男子 引体向上团体赛',
      '2201' => '女子 4×100米接力',
      '2202' => '女子 4×400米接力',
      '2203' => '女子 三人踏板竞速',
      '2204' => '女子 仰卧起坐团体赛',
      '2301' => '男女 十人十一足',
      '2302' => '男女 七人龙卷风',
      '2303' => '男女 接力投“篮”',
      '2304' => '男女 障碍迎面接力',
      '2305' => '男女 立定跳远团体赛'
    ]
  ],

  //校运会比赛排名积分配置
  'integral' => [
    '0' => 9,
    '1' => 7,
    '2' => 6,
    '3' => 5,
    '4' => 4,
    '5' => 3,
    '6' => 2,
    '7' => 1,
    'new' => 7,
    'newp' => 14
  ],

]
 ?>
